deploy-docker/lambda/gen_soap_script_single_msg/generated_soap_xml_files/T0003_33_A.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:s0="http://pic.rfi.it/ssdc2pic"
    xmlns:s1="http://microsoft.com/wsdl/types/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <s0:SendAndamentoTreni>
            <andamentoTreni xsi:type="s0:AndamentoTreni">
                <codGCMMitt xsi:type="xsd:int">25</codGCMMitt>
                <numSezioneMitt xsi:type="xsd:int">7</numSezioneMitt>
                <dtGenerazione xsi:type="xsd:dateTime">2024-09-18T11:00:08</dtGenerazione>
                <treno xsi:type="s0:Treno">
                    <numero xsi:type="xsd:string">T0003</numero>
                    <dataPartenza xsi:type="xsd:dateTime">2024-09-17</dataPartenza>
                    <codLocalita xsi:type="xsd:int">41</codLocalita>
                </treno>
                <passaggiTreno SOAP-ENC:arrayType="s0:PassaggioTreno[47]" SOAP-ENC:offset="[0]"
                    xsi:type="SOAP-ENC:Array">
                    <item xsi:type="s0:PassaggioTreno">
                        <codLocalita xsi:type="xsd:int">33</codLocalita>
                        <dtArrivo xsi:type="xsd:dateTime">2024-09-17T16:50:30</dtArrivo>
                        <scostamentoArrivo xsi:type="xsd:int">3270</scostamentoArrivo>
                        <tipArrivo xsi:type="s1:char">82</tipArrivo>
                        <dtPartenza xsi:type="xsd:dateTime">2024-09-18T10:50:00</dtPartenza>
                        <tipPartenza xsi:type="s1:char">82s</tipPartenza>
                        <scostamentoPartenza xsi:type="xsd:int">68040</scostamentoPartenza>
                        <codTrattaSucc xsi:type="xsd:int">1062</codTrattaSucc>
                        <binario xsi:type="s1:char">83</binario>
                        <tipCategoria xsi:type="xsd:int">2</tipCategoria>
                        <tipServizio xsi:type="s1:char">86</tipServizio>
                        <tipClassifica xsi:type="s1:char">79</tipClassifica>
                    </item>
                </passaggiTreno>
            </andamentoTreni>
        </s0:SendAndamentoTreni>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
